package telegram

func confirmationKeyboard() [][]string {
	return [][]string{{ConfirmText}, {DeclineText}}
}

func mainMenuKeyboard() [][]string {
	return [][]string{
		{"💌 به مخاطب خاصم وصلم کن"},
		{"📓 لیست مخاطبین من"},
		{"📨 لینک ناشناس من", "✏️ ویرایش پروفایل"},
		{"🗣 Language", "💡راهنما"},
	}
}

func provincesKeyboard() [][]string {
	return [][]string{
		{"آذربایجان شرقی", "آذربایجان غربی", "اردبیل"},
		{"اصفهان", "البرز", "ایلام"},
		{"بوشهر", "تهران", "چهارمحال و بختیاری"},
		{"خراسان جنوبی", "خراسان رضوی", "خراسان شمالی"},
		{"خوزستان", "زنجان", "سمنان"},
		{"سیستان و بلوچستان", "فارس", "قزوین"},
		{"قم", "کردستان", "کرمان"},
		{"کرمانشاه", "کهگیلویه و بویراحمد", "گلستان"},
		{"گیلان", "لرستان", "مازندران"},
		{"مرکزی", "هرمزگان", "همدان"},
		{"یزد"},
	}
}

func agesKeyboard() [][]string {
	return [][]string{
		{"12", "13", "14", "15", "16", "17"},
		{"18", "19", "20", "21", "22", "23"},
		{"24", "25", "26", "27", "28", "29"},
		{"30", "31", "32", "33", "34", "35"},
		{"36", "37", "38", "39", "40", "41"},
		{"42", "43", "44", "45", "46", "47"},
		{"48", "49", "50", "51", "52", "53"},
		{"54", "55", "56", "57", "58", "59"},
		{"60", "61", "62", "63", "64", "65"},
		{"66", "67", "68", "69", "70", "71"},
		{"72", "73", "74", "75", "76", "77"},
	}
}

func genderKeyboard() [][]string {
	return [][]string{
		{femaleGenderKeyboard, maleGenderKeyboard},
		{nonBinaryGenderKeyboard},
	}
}
